Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/tc.h
/* -------- TC_QSR : (TC Offset: 0xDC) ( R/ 32) QDEC Status Register -------- */
#define TC_QSR_DIR_Pos                        _U_(8)                                               /**< (TC_QSR) Direction Position */
#define TC_QSR_DIR_Msk                        (_U_(0x1) << TC_QSR_DIR_Pos)                         /**< (TC_QSR) Direction Mask */
#define TC_QSR_DIR(value)                     (TC_QSR_DIR_Msk & ((value) << TC_QSR_DIR_Pos))      
#define TC_QSR_Msk                            _U_(0x00000100)                                      /**< (TC_QSR) Register Mask  */


/* -------- TC_WPMR : (TC Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define TC_WPMR_WPEN_Pos                      _U_(0)                                               /**< (TC_WPMR) Write Protection Enable Position */
#define TC_WPMR_WPEN_Msk                      (_U_(0x1) << TC_WPMR_WPEN_Pos)                       /**< (TC_WPMR) Write Protection Enable Mask */
#define TC_WPMR_WPEN(value)                   (TC_WPMR_WPEN_Msk & ((value) << TC_WPMR_WPEN_Pos))  
#define TC_WPMR_WPITEN_Pos                    _U_(1)                                               /**< (TC_WPMR) Write Protection Interrupt Enable Position */
#define TC_WPMR_WPITEN_Msk                    (_U_(0x1) << TC_WPMR_WPITEN_Pos)                     /**< (TC_WPMR) Write Protection Interrupt Enable Mask */
#define TC_WPMR_WPITEN(value)                 (TC_WPMR_WPITEN_Msk & ((value) << TC_WPMR_WPITEN_Pos))
#define TC_WPMR_WPCREN_Pos                    _U_(2)                                               /**< (TC_WPMR) Write Protection Control Enable Position */
#define TC_WPMR_WPCREN_Msk                    (_U_(0x1) << TC_WPMR_WPCREN_Pos)                     /**< (TC_WPMR) Write Protection Control Enable Mask */
#define TC_WPMR_WPCREN(value)                 (TC_WPMR_WPCREN_Msk & ((value) << TC_WPMR_WPCREN_Pos))
#define TC_WPMR_FIRSTE_Pos                    _U_(4)                                               /**< (TC_WPMR) First Error Report Enable Position */
#define TC_WPMR_FIRSTE_Msk                    (_U_(0x1) << TC_WPMR_FIRSTE_Pos)                     /**< (TC_WPMR) First Error Report Enable Mask */
#define TC_WPMR_FIRSTE(value)                 (TC_WPMR_FIRSTE_Msk & ((value) << TC_WPMR_FIRSTE_Pos))
#define TC_WPMR_WPKEY_Pos                     _U_(8)                                               /**< (TC_WPMR) Write Protection Key Position */
#define TC_WPMR_WPKEY_Msk                     (_U_(0xFFFFFF) << TC_WPMR_WPKEY_Pos)                 /**< (TC_WPMR) Write Protection Key Mask */
#define TC_WPMR_WPKEY(value)                  (TC_WPMR_WPKEY_Msk & ((value) << TC_WPMR_WPKEY_Pos))
#define   TC_WPMR_WPKEY_PASSWD_Val            _U_(0x54494D)                                        /**< (TC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.  */
#define TC_WPMR_WPKEY_PASSWD                  (TC_WPMR_WPKEY_PASSWD_Val << TC_WPMR_WPKEY_Pos)      /**< (TC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0. Position  */
#define TC_WPMR_Msk                           _U_(0xFFFFFF17)                                      /**< (TC_WPMR) Register Mask  */


/* -------- TC_VER : (TC Offset: 0xFC) ( R/ 32) Version Register -------- */
#define TC_VER_VERSION_Pos                    _U_(0)                                               /**< (TC_VER) Version of the Hardware Module Position */
#define TC_VER_VERSION_Msk                    (_U_(0xFFF) << TC_VER_VERSION_Pos)                   /**< (TC_VER) Version of the Hardware Module Mask */
#define TC_VER_VERSION(value)                 (TC_VER_VERSION_Msk & ((value) << TC_VER_VERSION_Pos))
#define TC_VER_MFN_Pos                        _U_(16)                                              /**< (TC_VER) Metal Fix Number Position */
#define TC_VER_MFN_Msk                        (_U_(0x7) << TC_VER_MFN_Pos)                         /**< (TC_VER) Metal Fix Number Mask */
#define TC_VER_MFN(value)                     (TC_VER_MFN_Msk & ((value) << TC_VER_MFN_Pos))      
#define TC_VER_Msk                            _U_(0x00070FFF)                                      /**< (TC_VER) Register Mask  */


/** \brief TC register offsets definitions */
#define TC_CCR_REG_OFST                (0x00)              /**< (TC_CCR) Channel Control Register Offset */
#define TC_CMR_REG_OFST                (0x04)              /**< (TC_CMR) Channel Mode Register Offset */
#define TC_SMMR_REG_OFST               (0x08)              /**< (TC_SMMR) Stepper Motor Mode Register Offset */
#define TC_RAB_REG_OFST                (0x0C)              /**< (TC_RAB) Register AB Offset */
#define TC_CV_REG_OFST                 (0x10)              /**< (TC_CV) Counter Value Offset */
#define TC_RA_REG_OFST                 (0x14)              /**< (TC_RA) Register A Offset */
#define TC_RB_REG_OFST                 (0x18)              /**< (TC_RB) Register B Offset */
#define TC_RC_REG_OFST                 (0x1C)              /**< (TC_RC) Register C Offset */
#define TC_SR_REG_OFST                 (0x20)              /**< (TC_SR) Interrupt Status Register Offset */
#define TC_IER_REG_OFST                (0x24)              /**< (TC_IER) Interrupt Enable Register Offset */
#define TC_IDR_REG_OFST                (0x28)              /**< (TC_IDR) Interrupt Disable Register Offset */
#define TC_IMR_REG_OFST                (0x2C)              /**< (TC_IMR) Interrupt Mask Register Offset */
#define TC_EMR_REG_OFST                (0x30)              /**< (TC_EMR) Extended Mode Register Offset */
#define TC_CSR_REG_OFST                (0x34)              /**< (TC_CSR) Channel Status Register Offset */
#define TC_SSR_REG_OFST                (0x38)              /**< (TC_SSR) Safety Status Register Offset */
#define TC_BCR_REG_OFST                (0xC0)              /**< (TC_BCR) Block Control Register Offset */
#define TC_BMR_REG_OFST                (0xC4)              /**< (TC_BMR) Block Mode Register Offset */
#define TC_QIER_REG_OFST               (0xC8)              /**< (TC_QIER) QDEC Interrupt Enable Register Offset */
#define TC_QIDR_REG_OFST               (0xCC)              /**< (TC_QIDR) QDEC Interrupt Disable Register Offset */
#define TC_QIMR_REG_OFST               (0xD0)              /**< (TC_QIMR) QDEC Interrupt Mask Register Offset */
#define TC_QISR_REG_OFST               (0xD4)              /**< (TC_QISR) QDEC Interrupt Status Register Offset */
#define TC_FMR_REG_OFST                (0xD8)              /**< (TC_FMR) Fault Mode Register Offset */
#define TC_QSR_REG_OFST                (0xDC)              /**< (TC_QSR) QDEC Status Register Offset */
#define TC_WPMR_REG_OFST               (0xE4)              /**< (TC_WPMR) Write Protection Mode Register Offset */
#define TC_VER_REG_OFST                (0xFC)              /**< (TC_VER) Version Register Offset */

